MikroElektronika/core_packages/PIC/XC8/def/PIC18F56Q43/mcu.h
// Register: I2C1CNT
#define I2C1CNT I2C1CNT
extern volatile unsigned char           I2C1CNT             __at(0x28D);
#ifndef _LIB_BUILD
asm("I2C1CNT equ 028Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CNT                    :8;
    };
    struct {
        unsigned CNT0                   :1;
        unsigned CNT1                   :1;
        unsigned CNT2                   :1;
        unsigned CNT3                   :1;
        unsigned CNT4                   :1;
        unsigned CNT5                   :1;
        unsigned CNT6                   :1;
        unsigned CNT7                   :1;
    };
} I2C1CNTbits_t;
extern volatile I2C1CNTbits_t I2C1CNTbits __at(0x28D);
// bitfield macros
#define _I2C1CNT_CNT_POSN                                   0x0
#define _I2C1CNT_CNT_POSITION                               0x0
#define _I2C1CNT_CNT_SIZE                                   0x8
#define _I2C1CNT_CNT_LENGTH                                 0x8
#define _I2C1CNT_CNT_MASK                                   0xFF
#define _I2C1CNT_CNT0_POSN                                  0x0
#define _I2C1CNT_CNT0_POSITION                              0x0
#define _I2C1CNT_CNT0_SIZE                                  0x1
#define _I2C1CNT_CNT0_LENGTH                                0x1
#define _I2C1CNT_CNT0_MASK                                  0x1
#define _I2C1CNT_CNT1_POSN                                  0x1
#define _I2C1CNT_CNT1_POSITION                              0x1
#define _I2C1CNT_CNT1_SIZE                                  0x1
#define _I2C1CNT_CNT1_LENGTH                                0x1
#define _I2C1CNT_CNT1_MASK                                  0x2
#define _I2C1CNT_CNT2_POSN                                  0x2
#define _I2C1CNT_CNT2_POSITION                              0x2
#define _I2C1CNT_CNT2_SIZE                                  0x1
#define _I2C1CNT_CNT2_LENGTH                                0x1
#define _I2C1CNT_CNT2_MASK                                  0x4
#define _I2C1CNT_CNT3_POSN                                  0x3
#define _I2C1CNT_CNT3_POSITION                              0x3
#define _I2C1CNT_CNT3_SIZE                                  0x1
#define _I2C1CNT_CNT3_LENGTH                                0x1
#define _I2C1CNT_CNT3_MASK                                  0x8
#define _I2C1CNT_CNT4_POSN                                  0x4
#define _I2C1CNT_CNT4_POSITION                              0x4
#define _I2C1CNT_CNT4_SIZE                                  0x1
#define _I2C1CNT_CNT4_LENGTH                                0x1
#define _I2C1CNT_CNT4_MASK                                  0x10
#define _I2C1CNT_CNT5_POSN                                  0x5
#define _I2C1CNT_CNT5_POSITION                              0x5
#define _I2C1CNT_CNT5_SIZE                                  0x1
#define _I2C1CNT_CNT5_LENGTH                                0x1
#define _I2C1CNT_CNT5_MASK                                  0x20
#define _I2C1CNT_CNT6_POSN                                  0x6
#define _I2C1CNT_CNT6_POSITION                              0x6
#define _I2C1CNT_CNT6_SIZE                                  0x1
#define _I2C1CNT_CNT6_LENGTH                                0x1
#define _I2C1CNT_CNT6_MASK                                  0x40
#define _I2C1CNT_CNT7_POSN                                  0x7
#define _I2C1CNT_CNT7_POSITION                              0x7
#define _I2C1CNT_CNT7_SIZE                                  0x1
#define _I2C1CNT_CNT7_LENGTH                                0x1
#define _I2C1CNT_CNT7_MASK                                  0x80

// Register: I2C1ADB0
#define I2C1ADB0 I2C1ADB0
extern volatile unsigned char           I2C1ADB0            __at(0x28E);
#ifndef _LIB_BUILD
asm("I2C1ADB0 equ 028Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADB                    :8;
    };
} I2C1ADB0bits_t;
extern volatile I2C1ADB0bits_t I2C1ADB0bits __at(0x28E);
// bitfield macros
#define _I2C1ADB0_ADB_POSN                                  0x0
#define _I2C1ADB0_ADB_POSITION                              0x0
#define _I2C1ADB0_ADB_SIZE                                  0x8
#define _I2C1ADB0_ADB_LENGTH                                0x8
#define _I2C1ADB0_ADB_MASK                                  0xFF

// Register: I2C1ADB1
#define I2C1ADB1 I2C1ADB1
extern volatile unsigned char           I2C1ADB1            __at(0x28F);
#ifndef _LIB_BUILD
asm("I2C1ADB1 equ 028Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADB                    :8;
    };
} I2C1ADB1bits_t;
extern volatile I2C1ADB1bits_t I2C1ADB1bits __at(0x28F);
// bitfield macros
#define _I2C1ADB1_ADB_POSN                                  0x0
#define _I2C1ADB1_ADB_POSITION                              0x0
#define _I2C1ADB1_ADB_SIZE                                  0x8
#define _I2C1ADB1_ADB_LENGTH                                0x8
#define _I2C1ADB1_ADB_MASK                                  0xFF

// Register: I2C1ADR0
#define I2C1ADR0 I2C1ADR0
extern volatile unsigned char           I2C1ADR0            __at(0x290);
#ifndef _LIB_BUILD
asm("I2C1ADR0 equ 0290h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADR                    :8;
    };
} I2C1ADR0bits_t;
extern volatile I2C1ADR0bits_t I2C1ADR0bits __at(0x290);
// bitfield macros
#define _I2C1ADR0_ADR_POSN                                  0x0
#define _I2C1ADR0_ADR_POSITION                              0x0
#define _I2C1ADR0_ADR_SIZE                                  0x8
#define _I2C1ADR0_ADR_LENGTH                                0x8
#define _I2C1ADR0_ADR_MASK                                  0xFF

// Register: I2C1ADR1
#define I2C1ADR1 I2C1ADR1
extern volatile unsigned char           I2C1ADR1            __at(0x291);
#ifndef _LIB_BUILD
asm("I2C1ADR1 equ 0291h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned ADR                    :7;
    };
} I2C1ADR1bits_t;
extern volatile I2C1ADR1bits_t I2C1ADR1bits __at(0x291);
// bitfield macros
#define _I2C1ADR1_ADR_POSN                                  0x1
#define _I2C1ADR1_ADR_POSITION                              0x1
#define _I2C1ADR1_ADR_SIZE                                  0x7
#define _I2C1ADR1_ADR_LENGTH                                0x7
#define _I2C1ADR1_ADR_MASK                                  0xFE

// Register: I2C1ADR2
#define I2C1ADR2 I2C1ADR2
extern volatile unsigned char           I2C1ADR2            __at(0x292);
#ifndef _LIB_BUILD
asm("I2C1ADR2 equ 0292h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADR                    :8;
    };
} I2C1ADR2bits_t;
extern volatile I2C1ADR2bits_t I2C1ADR2bits __at(0x292);
// bitfield macros
#define _I2C1ADR2_ADR_POSN                                  0x0
#define _I2C1ADR2_ADR_POSITION                              0x0
#define _I2C1ADR2_ADR_SIZE                                  0x8
#define _I2C1ADR2_ADR_LENGTH                                0x8
#define _I2C1ADR2_ADR_MASK                                  0xFF

// Register: I2C1ADR3
#define I2C1ADR3 I2C1ADR3
extern volatile unsigned char           I2C1ADR3            __at(0x293);
#ifndef _LIB_BUILD
asm("I2C1ADR3 equ 0293h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned ADR                    :7;
    };
} I2C1ADR3bits_t;
