MikroElektronika/core_packages/PIC/XC8/def/PIC18F56Q43/mcu.h
// Register: U3UIR
#define U3UIR U3UIR
extern volatile unsigned char           U3UIR               __at(0x2D7);
#ifndef _LIB_BUILD
asm("U3UIR equ 02D7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned ABDIE                  :1;
        unsigned                        :3;
        unsigned ABDIF                  :1;
        unsigned WUIF                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned U3ABDIE                :1;
        unsigned                        :3;
        unsigned U3ABDIF                :1;
        unsigned U3WUIF                 :1;
    };
} U3UIRbits_t;
extern volatile U3UIRbits_t U3UIRbits __at(0x2D7);
// bitfield macros
#define _U3UIR_ABDIE_POSN                                   0x2
#define _U3UIR_ABDIE_POSITION                               0x2
#define _U3UIR_ABDIE_SIZE                                   0x1
#define _U3UIR_ABDIE_LENGTH                                 0x1
#define _U3UIR_ABDIE_MASK                                   0x4
#define _U3UIR_ABDIF_POSN                                   0x6
#define _U3UIR_ABDIF_POSITION                               0x6
#define _U3UIR_ABDIF_SIZE                                   0x1
#define _U3UIR_ABDIF_LENGTH                                 0x1
#define _U3UIR_ABDIF_MASK                                   0x40
#define _U3UIR_WUIF_POSN                                    0x7
#define _U3UIR_WUIF_POSITION                                0x7
#define _U3UIR_WUIF_SIZE                                    0x1
#define _U3UIR_WUIF_LENGTH                                  0x1
#define _U3UIR_WUIF_MASK                                    0x80
#define _U3UIR_U3ABDIE_POSN                                 0x2
#define _U3UIR_U3ABDIE_POSITION                             0x2
#define _U3UIR_U3ABDIE_SIZE                                 0x1
#define _U3UIR_U3ABDIE_LENGTH                               0x1
#define _U3UIR_U3ABDIE_MASK                                 0x4
#define _U3UIR_U3ABDIF_POSN                                 0x6
#define _U3UIR_U3ABDIF_POSITION                             0x6
#define _U3UIR_U3ABDIF_SIZE                                 0x1
#define _U3UIR_U3ABDIF_LENGTH                               0x1
#define _U3UIR_U3ABDIF_MASK                                 0x40
#define _U3UIR_U3WUIF_POSN                                  0x7
#define _U3UIR_U3WUIF_POSITION                              0x7
#define _U3UIR_U3WUIF_SIZE                                  0x1
#define _U3UIR_U3WUIF_LENGTH                                0x1
#define _U3UIR_U3WUIF_MASK                                  0x80

// Register: U3ERRIR
#define U3ERRIR U3ERRIR
extern volatile unsigned char           U3ERRIR             __at(0x2D8);
#ifndef _LIB_BUILD
asm("U3ERRIR equ 02D8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXCIF                  :1;
        unsigned RXFOIF                 :1;
        unsigned RXBKIF                 :1;
        unsigned FERIF                  :1;
        unsigned CERIF                  :1;
        unsigned ABDOVF                 :1;
        unsigned PERIF                  :1;
        unsigned TXMTIF                 :1;
    };
    struct {
        unsigned U3TXCIF                :1;
        unsigned U3RXFOIF               :1;
        unsigned U3RXBKIF               :1;
        unsigned U3FERIF                :1;
        unsigned U3CERIF                :1;
        unsigned U3ABDOVF               :1;
        unsigned U3PERIF                :1;
        unsigned U3TXMTIF               :1;
    };
} U3ERRIRbits_t;
extern volatile U3ERRIRbits_t U3ERRIRbits __at(0x2D8);
// bitfield macros
#define _U3ERRIR_TXCIF_POSN                                 0x0
#define _U3ERRIR_TXCIF_POSITION                             0x0
#define _U3ERRIR_TXCIF_SIZE                                 0x1
#define _U3ERRIR_TXCIF_LENGTH                               0x1
#define _U3ERRIR_TXCIF_MASK                                 0x1
#define _U3ERRIR_RXFOIF_POSN                                0x1
#define _U3ERRIR_RXFOIF_POSITION                            0x1
#define _U3ERRIR_RXFOIF_SIZE                                0x1
#define _U3ERRIR_RXFOIF_LENGTH                              0x1
#define _U3ERRIR_RXFOIF_MASK                                0x2
#define _U3ERRIR_RXBKIF_POSN                                0x2
#define _U3ERRIR_RXBKIF_POSITION                            0x2
#define _U3ERRIR_RXBKIF_SIZE                                0x1
#define _U3ERRIR_RXBKIF_LENGTH                              0x1
#define _U3ERRIR_RXBKIF_MASK                                0x4
#define _U3ERRIR_FERIF_POSN                                 0x3
#define _U3ERRIR_FERIF_POSITION                             0x3
#define _U3ERRIR_FERIF_SIZE                                 0x1
#define _U3ERRIR_FERIF_LENGTH                               0x1
#define _U3ERRIR_FERIF_MASK                                 0x8
#define _U3ERRIR_CERIF_POSN                                 0x4
#define _U3ERRIR_CERIF_POSITION                             0x4
#define _U3ERRIR_CERIF_SIZE                                 0x1
#define _U3ERRIR_CERIF_LENGTH                               0x1
#define _U3ERRIR_CERIF_MASK                                 0x10
#define _U3ERRIR_ABDOVF_POSN                                0x5
#define _U3ERRIR_ABDOVF_POSITION                            0x5
#define _U3ERRIR_ABDOVF_SIZE                                0x1
#define _U3ERRIR_ABDOVF_LENGTH                              0x1
#define _U3ERRIR_ABDOVF_MASK                                0x20
#define _U3ERRIR_PERIF_POSN                                 0x6
#define _U3ERRIR_PERIF_POSITION                             0x6
#define _U3ERRIR_PERIF_SIZE                                 0x1
#define _U3ERRIR_PERIF_LENGTH                               0x1
#define _U3ERRIR_PERIF_MASK                                 0x40
#define _U3ERRIR_TXMTIF_POSN                                0x7
#define _U3ERRIR_TXMTIF_POSITION                            0x7
#define _U3ERRIR_TXMTIF_SIZE                                0x1
#define _U3ERRIR_TXMTIF_LENGTH                              0x1
#define _U3ERRIR_TXMTIF_MASK                                0x80
#define _U3ERRIR_U3TXCIF_POSN                               0x0
#define _U3ERRIR_U3TXCIF_POSITION                           0x0
#define _U3ERRIR_U3TXCIF_SIZE                               0x1
#define _U3ERRIR_U3TXCIF_LENGTH                             0x1
#define _U3ERRIR_U3TXCIF_MASK                               0x1
#define _U3ERRIR_U3RXFOIF_POSN                              0x1
#define _U3ERRIR_U3RXFOIF_POSITION                          0x1
#define _U3ERRIR_U3RXFOIF_SIZE                              0x1
#define _U3ERRIR_U3RXFOIF_LENGTH                            0x1
#define _U3ERRIR_U3RXFOIF_MASK                              0x2
#define _U3ERRIR_U3RXBKIF_POSN                              0x2
#define _U3ERRIR_U3RXBKIF_POSITION                          0x2
#define _U3ERRIR_U3RXBKIF_SIZE                              0x1
#define _U3ERRIR_U3RXBKIF_LENGTH                            0x1
#define _U3ERRIR_U3RXBKIF_MASK                              0x4
#define _U3ERRIR_U3FERIF_POSN                               0x3
#define _U3ERRIR_U3FERIF_POSITION                           0x3
#define _U3ERRIR_U3FERIF_SIZE                               0x1
#define _U3ERRIR_U3FERIF_LENGTH                             0x1
#define _U3ERRIR_U3FERIF_MASK                               0x8
#define _U3ERRIR_U3CERIF_POSN                               0x4
#define _U3ERRIR_U3CERIF_POSITION                           0x4
#define _U3ERRIR_U3CERIF_SIZE                               0x1
#define _U3ERRIR_U3CERIF_LENGTH                             0x1
#define _U3ERRIR_U3CERIF_MASK                               0x10
#define _U3ERRIR_U3ABDOVF_POSN                              0x5
#define _U3ERRIR_U3ABDOVF_POSITION                          0x5
#define _U3ERRIR_U3ABDOVF_SIZE                              0x1
#define _U3ERRIR_U3ABDOVF_LENGTH                            0x1
#define _U3ERRIR_U3ABDOVF_MASK                              0x20
#define _U3ERRIR_U3PERIF_POSN                               0x6
#define _U3ERRIR_U3PERIF_POSITION                           0x6
#define _U3ERRIR_U3PERIF_SIZE                               0x1
#define _U3ERRIR_U3PERIF_LENGTH                             0x1
#define _U3ERRIR_U3PERIF_MASK                               0x40
#define _U3ERRIR_U3TXMTIF_POSN                              0x7
#define _U3ERRIR_U3TXMTIF_POSITION                          0x7
#define _U3ERRIR_U3TXMTIF_SIZE                              0x1
#define _U3ERRIR_U3TXMTIF_LENGTH                            0x1
#define _U3ERRIR_U3TXMTIF_MASK                              0x80

