MikroElektronika/core_packages/PIC/XC8/def/PIC18F56Q43/mcu.h
extern volatile T3CLKbits_t T3CLKbits __at(0x32D);
// bitfield macros
#define _T3CLK_CS_POSN                                      0x0
#define _T3CLK_CS_POSITION                                  0x0
#define _T3CLK_CS_SIZE                                      0x8
#define _T3CLK_CS_LENGTH                                    0x8
#define _T3CLK_CS_MASK                                      0xFF
#define _T3CLK_T3CS0_POSN                                   0x0
#define _T3CLK_T3CS0_POSITION                               0x0
#define _T3CLK_T3CS0_SIZE                                   0x1
#define _T3CLK_T3CS0_LENGTH                                 0x1
#define _T3CLK_T3CS0_MASK                                   0x1
#define _T3CLK_T3CS1_POSN                                   0x1
#define _T3CLK_T3CS1_POSITION                               0x1
#define _T3CLK_T3CS1_SIZE                                   0x1
#define _T3CLK_T3CS1_LENGTH                                 0x1
#define _T3CLK_T3CS1_MASK                                   0x2
#define _T3CLK_T3CS2_POSN                                   0x2
#define _T3CLK_T3CS2_POSITION                               0x2
#define _T3CLK_T3CS2_SIZE                                   0x1
#define _T3CLK_T3CS2_LENGTH                                 0x1
#define _T3CLK_T3CS2_MASK                                   0x4
#define _T3CLK_T3CS3_POSN                                   0x3
#define _T3CLK_T3CS3_POSITION                               0x3
#define _T3CLK_T3CS3_SIZE                                   0x1
#define _T3CLK_T3CS3_LENGTH                                 0x1
#define _T3CLK_T3CS3_MASK                                   0x8
#define _T3CLK_T3CS4_POSN                                   0x4
#define _T3CLK_T3CS4_POSITION                               0x4
#define _T3CLK_T3CS4_SIZE                                   0x1
#define _T3CLK_T3CS4_LENGTH                                 0x1
#define _T3CLK_T3CS4_MASK                                   0x10
#define _T3CLK_CS0_POSN                                     0x0
#define _T3CLK_CS0_POSITION                                 0x0
#define _T3CLK_CS0_SIZE                                     0x1
#define _T3CLK_CS0_LENGTH                                   0x1
#define _T3CLK_CS0_MASK                                     0x1
#define _T3CLK_CS1_POSN                                     0x1
#define _T3CLK_CS1_POSITION                                 0x1
#define _T3CLK_CS1_SIZE                                     0x1
#define _T3CLK_CS1_LENGTH                                   0x1
#define _T3CLK_CS1_MASK                                     0x2
#define _T3CLK_CS2_POSN                                     0x2
#define _T3CLK_CS2_POSITION                                 0x2
#define _T3CLK_CS2_SIZE                                     0x1
#define _T3CLK_CS2_LENGTH                                   0x1
#define _T3CLK_CS2_MASK                                     0x4
#define _T3CLK_CS3_POSN                                     0x3
#define _T3CLK_CS3_POSITION                                 0x3
#define _T3CLK_CS3_SIZE                                     0x1
#define _T3CLK_CS3_LENGTH                                   0x1
#define _T3CLK_CS3_MASK                                     0x8
#define _T3CLK_CS4_POSN                                     0x4
#define _T3CLK_CS4_POSITION                                 0x4
#define _T3CLK_CS4_SIZE                                     0x1
#define _T3CLK_CS4_LENGTH                                   0x1
#define _T3CLK_CS4_MASK                                     0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned CS                     :8;
    };
    struct {
        unsigned T3CS0                  :1;
        unsigned T3CS1                  :1;
        unsigned T3CS2                  :1;
        unsigned T3CS3                  :1;
        unsigned T3CS4                  :1;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned CS2                    :1;
        unsigned CS3                    :1;
        unsigned CS4                    :1;
    };
} TMR3CLKbits_t;
extern volatile TMR3CLKbits_t TMR3CLKbits __at(0x32D);
// bitfield macros
#define _TMR3CLK_CS_POSN                                    0x0
#define _TMR3CLK_CS_POSITION                                0x0
#define _TMR3CLK_CS_SIZE                                    0x8
#define _TMR3CLK_CS_LENGTH                                  0x8
#define _TMR3CLK_CS_MASK                                    0xFF
#define _TMR3CLK_T3CS0_POSN                                 0x0
#define _TMR3CLK_T3CS0_POSITION                             0x0
#define _TMR3CLK_T3CS0_SIZE                                 0x1
#define _TMR3CLK_T3CS0_LENGTH                               0x1
#define _TMR3CLK_T3CS0_MASK                                 0x1
#define _TMR3CLK_T3CS1_POSN                                 0x1
#define _TMR3CLK_T3CS1_POSITION                             0x1
#define _TMR3CLK_T3CS1_SIZE                                 0x1
#define _TMR3CLK_T3CS1_LENGTH                               0x1
#define _TMR3CLK_T3CS1_MASK                                 0x2
#define _TMR3CLK_T3CS2_POSN                                 0x2
#define _TMR3CLK_T3CS2_POSITION                             0x2
#define _TMR3CLK_T3CS2_SIZE                                 0x1
#define _TMR3CLK_T3CS2_LENGTH                               0x1
#define _TMR3CLK_T3CS2_MASK                                 0x4
#define _TMR3CLK_T3CS3_POSN                                 0x3
#define _TMR3CLK_T3CS3_POSITION                             0x3
#define _TMR3CLK_T3CS3_SIZE                                 0x1
#define _TMR3CLK_T3CS3_LENGTH                               0x1
#define _TMR3CLK_T3CS3_MASK                                 0x8
#define _TMR3CLK_T3CS4_POSN                                 0x4
#define _TMR3CLK_T3CS4_POSITION                             0x4
#define _TMR3CLK_T3CS4_SIZE                                 0x1
#define _TMR3CLK_T3CS4_LENGTH                               0x1
#define _TMR3CLK_T3CS4_MASK                                 0x10
#define _TMR3CLK_CS0_POSN                                   0x0
#define _TMR3CLK_CS0_POSITION                               0x0
#define _TMR3CLK_CS0_SIZE                                   0x1
#define _TMR3CLK_CS0_LENGTH                                 0x1
#define _TMR3CLK_CS0_MASK                                   0x1
#define _TMR3CLK_CS1_POSN                                   0x1
#define _TMR3CLK_CS1_POSITION                               0x1
#define _TMR3CLK_CS1_SIZE                                   0x1
#define _TMR3CLK_CS1_LENGTH                                 0x1
#define _TMR3CLK_CS1_MASK                                   0x2
#define _TMR3CLK_CS2_POSN                                   0x2
#define _TMR3CLK_CS2_POSITION                               0x2
#define _TMR3CLK_CS2_SIZE                                   0x1
#define _TMR3CLK_CS2_LENGTH                                 0x1
#define _TMR3CLK_CS2_MASK                                   0x4
#define _TMR3CLK_CS3_POSN                                   0x3
#define _TMR3CLK_CS3_POSITION                               0x3
#define _TMR3CLK_CS3_SIZE                                   0x1
#define _TMR3CLK_CS3_LENGTH                                 0x1
#define _TMR3CLK_CS3_MASK                                   0x8
#define _TMR3CLK_CS4_POSN                                   0x4
#define _TMR3CLK_CS4_POSITION                               0x4
#define _TMR3CLK_CS4_SIZE                                   0x1
#define _TMR3CLK_CS4_LENGTH                                 0x1
#define _TMR3CLK_CS4_MASK                                   0x10
typedef union {
    struct {
        unsigned CS                     :8;
    };
    struct {
        unsigned T3CS0                  :1;
        unsigned T3CS1                  :1;
        unsigned T3CS2                  :1;
        unsigned T3CS3                  :1;
        unsigned T3CS4                  :1;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned CS2                    :1;
        unsigned CS3                    :1;
        unsigned CS4                    :1;
    };
} PR3bits_t;
extern volatile PR3bits_t PR3bits __at(0x32D);
// bitfield macros
#define _PR3_CS_POSN                                        0x0
#define _PR3_CS_POSITION                                    0x0
#define _PR3_CS_SIZE                                        0x8
#define _PR3_CS_LENGTH                                      0x8
#define _PR3_CS_MASK                                        0xFF
#define _PR3_T3CS0_POSN                                     0x0
#define _PR3_T3CS0_POSITION                                 0x0
#define _PR3_T3CS0_SIZE                                     0x1
#define _PR3_T3CS0_LENGTH                                   0x1
#define _PR3_T3CS0_MASK                                     0x1
#define _PR3_T3CS1_POSN                                     0x1
#define _PR3_T3CS1_POSITION                                 0x1
#define _PR3_T3CS1_SIZE                                     0x1
#define _PR3_T3CS1_LENGTH                                   0x1
#define _PR3_T3CS1_MASK                                     0x2
#define _PR3_T3CS2_POSN                                     0x2
#define _PR3_T3CS2_POSITION                                 0x2
#define _PR3_T3CS2_SIZE                                     0x1
#define _PR3_T3CS2_LENGTH                                   0x1
#define _PR3_T3CS2_MASK                                     0x4
#define _PR3_T3CS3_POSN                                     0x3
#define _PR3_T3CS3_POSITION                                 0x3
#define _PR3_T3CS3_SIZE                                     0x1
#define _PR3_T3CS3_LENGTH                                   0x1
#define _PR3_T3CS3_MASK                                     0x8
#define _PR3_T3CS4_POSN                                     0x4
#define _PR3_T3CS4_POSITION                                 0x4
#define _PR3_T3CS4_SIZE                                     0x1
#define _PR3_T3CS4_LENGTH                                   0x1
#define _PR3_T3CS4_MASK                                     0x10
#define _PR3_CS0_POSN                                       0x0
#define _PR3_CS0_POSITION                                   0x0
#define _PR3_CS0_SIZE                                       0x1
#define _PR3_CS0_LENGTH                                     0x1
#define _PR3_CS0_MASK                                       0x1
#define _PR3_CS1_POSN                                       0x1
#define _PR3_CS1_POSITION                                   0x1
#define _PR3_CS1_SIZE                                       0x1
#define _PR3_CS1_LENGTH                                     0x1
#define _PR3_CS1_MASK                                       0x2
#define _PR3_CS2_POSN                                       0x2
#define _PR3_CS2_POSITION                                   0x2
#define _PR3_CS2_SIZE                                       0x1
#define _PR3_CS2_LENGTH                                     0x1
#define _PR3_CS2_MASK                                       0x4
#define _PR3_CS3_POSN                                       0x3
#define _PR3_CS3_POSITION                                   0x3
#define _PR3_CS3_SIZE                                       0x1
#define _PR3_CS3_LENGTH                                     0x1
#define _PR3_CS3_MASK                                       0x8
#define _PR3_CS4_POSN                                       0x4
#define _PR3_CS4_POSITION                                   0x4
#define _PR3_CS4_SIZE                                       0x1
#define _PR3_CS4_LENGTH                                     0x1
#define _PR3_CS4_MASK                                       0x10

// Register: T4TMR
#define T4TMR T4TMR
extern volatile unsigned char           T4TMR               __at(0x32E);
#ifndef _LIB_BUILD
asm("T4TMR equ 032Eh");
#endif
// aliases
extern volatile unsigned char           TMR4                __at(0x32E);
#ifndef _LIB_BUILD
asm("TMR4 equ 032Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR4                   :8;
    };
} T4TMRbits_t;
extern volatile T4TMRbits_t T4TMRbits __at(0x32E);
// bitfield macros
#define _T4TMR_TMR4_POSN                                    0x0
#define _T4TMR_TMR4_POSITION                                0x0
#define _T4TMR_TMR4_SIZE                                    0x8
#define _T4TMR_TMR4_LENGTH                                  0x8
#define _T4TMR_TMR4_MASK                                    0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned TMR4                   :8;
    };
} TMR4bits_t;
