MikroElektronika/core_packages/PIC/XC8/def/PIC18F56Q43/mcu.h
// Register: CWG1AS0
#define CWG1AS0 CWG1AS0
extern volatile unsigned char           CWG1AS0             __at(0x3C2);
#ifndef _LIB_BUILD
asm("CWG1AS0 equ 03C2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned LSAC                   :2;
        unsigned LSDBD                  :2;
        unsigned REN                    :1;
        unsigned SHUTDOWN               :1;
    };
    struct {
        unsigned                        :2;
        unsigned LSAC0                  :1;
        unsigned LSCA1                  :1;
        unsigned LSDB0                  :1;
        unsigned LSDB1                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned CWG1LSAC0              :1;
        unsigned CWG1LSAC1              :1;
        unsigned CWG1LSDB0              :1;
        unsigned CWG1LSDB1              :1;
    };
    struct {
        unsigned                        :2;
        unsigned CWG1LSAC               :2;
        unsigned CWG1LSDB               :2;
    };
    struct {
        unsigned                        :4;
        unsigned LSBD                   :2;
    };
    struct {
        unsigned                        :3;
        unsigned LSAC1                  :1;
        unsigned LSBD0                  :1;
        unsigned LSBD1                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned CWG1LSBD0              :1;
        unsigned CWG1LSBD1              :1;
    };
    struct {
        unsigned                        :4;
        unsigned CWG1LSBD               :2;
    };
} CWG1AS0bits_t;
extern volatile CWG1AS0bits_t CWG1AS0bits __at(0x3C2);
// bitfield macros
#define _CWG1AS0_LSAC_POSN                                  0x2
#define _CWG1AS0_LSAC_POSITION                              0x2
#define _CWG1AS0_LSAC_SIZE                                  0x2
#define _CWG1AS0_LSAC_LENGTH                                0x2
#define _CWG1AS0_LSAC_MASK                                  0xC
#define _CWG1AS0_LSDBD_POSN                                 0x4
#define _CWG1AS0_LSDBD_POSITION                             0x4
#define _CWG1AS0_LSDBD_SIZE                                 0x2
#define _CWG1AS0_LSDBD_LENGTH                               0x2
#define _CWG1AS0_LSDBD_MASK                                 0x30
#define _CWG1AS0_REN_POSN                                   0x6
#define _CWG1AS0_REN_POSITION                               0x6
#define _CWG1AS0_REN_SIZE                                   0x1
#define _CWG1AS0_REN_LENGTH                                 0x1
#define _CWG1AS0_REN_MASK                                   0x40
#define _CWG1AS0_SHUTDOWN_POSN                              0x7
#define _CWG1AS0_SHUTDOWN_POSITION                          0x7
#define _CWG1AS0_SHUTDOWN_SIZE                              0x1
#define _CWG1AS0_SHUTDOWN_LENGTH                            0x1
#define _CWG1AS0_SHUTDOWN_MASK                              0x80
#define _CWG1AS0_LSAC0_POSN                                 0x2
#define _CWG1AS0_LSAC0_POSITION                             0x2
#define _CWG1AS0_LSAC0_SIZE                                 0x1
#define _CWG1AS0_LSAC0_LENGTH                               0x1
#define _CWG1AS0_LSAC0_MASK                                 0x4
#define _CWG1AS0_LSCA1_POSN                                 0x3
#define _CWG1AS0_LSCA1_POSITION                             0x3
#define _CWG1AS0_LSCA1_SIZE                                 0x1
#define _CWG1AS0_LSCA1_LENGTH                               0x1
#define _CWG1AS0_LSCA1_MASK                                 0x8
#define _CWG1AS0_LSDB0_POSN                                 0x4
#define _CWG1AS0_LSDB0_POSITION                             0x4
#define _CWG1AS0_LSDB0_SIZE                                 0x1
#define _CWG1AS0_LSDB0_LENGTH                               0x1
#define _CWG1AS0_LSDB0_MASK                                 0x10
#define _CWG1AS0_LSDB1_POSN                                 0x5
#define _CWG1AS0_LSDB1_POSITION                             0x5
#define _CWG1AS0_LSDB1_SIZE                                 0x1
#define _CWG1AS0_LSDB1_LENGTH                               0x1
#define _CWG1AS0_LSDB1_MASK                                 0x20
#define _CWG1AS0_CWG1LSAC0_POSN                             0x2
#define _CWG1AS0_CWG1LSAC0_POSITION                         0x2
#define _CWG1AS0_CWG1LSAC0_SIZE                             0x1
#define _CWG1AS0_CWG1LSAC0_LENGTH                           0x1
#define _CWG1AS0_CWG1LSAC0_MASK                             0x4
#define _CWG1AS0_CWG1LSAC1_POSN                             0x3
#define _CWG1AS0_CWG1LSAC1_POSITION                         0x3
#define _CWG1AS0_CWG1LSAC1_SIZE                             0x1
#define _CWG1AS0_CWG1LSAC1_LENGTH                           0x1
#define _CWG1AS0_CWG1LSAC1_MASK                             0x8
#define _CWG1AS0_CWG1LSDB0_POSN                             0x4
#define _CWG1AS0_CWG1LSDB0_POSITION                         0x4
#define _CWG1AS0_CWG1LSDB0_SIZE                             0x1
#define _CWG1AS0_CWG1LSDB0_LENGTH                           0x1
#define _CWG1AS0_CWG1LSDB0_MASK                             0x10
#define _CWG1AS0_CWG1LSDB1_POSN                             0x5
#define _CWG1AS0_CWG1LSDB1_POSITION                         0x5
#define _CWG1AS0_CWG1LSDB1_SIZE                             0x1
#define _CWG1AS0_CWG1LSDB1_LENGTH                           0x1
#define _CWG1AS0_CWG1LSDB1_MASK                             0x20
#define _CWG1AS0_CWG1LSAC_POSN                              0x2
#define _CWG1AS0_CWG1LSAC_POSITION                          0x2
#define _CWG1AS0_CWG1LSAC_SIZE                              0x2
#define _CWG1AS0_CWG1LSAC_LENGTH                            0x2
#define _CWG1AS0_CWG1LSAC_MASK                              0xC
#define _CWG1AS0_CWG1LSDB_POSN                              0x4
#define _CWG1AS0_CWG1LSDB_POSITION                          0x4
#define _CWG1AS0_CWG1LSDB_SIZE                              0x2
#define _CWG1AS0_CWG1LSDB_LENGTH                            0x2
#define _CWG1AS0_CWG1LSDB_MASK                              0x30
#define _CWG1AS0_LSBD_POSN                                  0x4
#define _CWG1AS0_LSBD_POSITION                              0x4
#define _CWG1AS0_LSBD_SIZE                                  0x2
#define _CWG1AS0_LSBD_LENGTH                                0x2
#define _CWG1AS0_LSBD_MASK                                  0x30
#define _CWG1AS0_LSAC1_POSN                                 0x3
#define _CWG1AS0_LSAC1_POSITION                             0x3
#define _CWG1AS0_LSAC1_SIZE                                 0x1
#define _CWG1AS0_LSAC1_LENGTH                               0x1
#define _CWG1AS0_LSAC1_MASK                                 0x8
#define _CWG1AS0_LSBD0_POSN                                 0x4
#define _CWG1AS0_LSBD0_POSITION                             0x4
#define _CWG1AS0_LSBD0_SIZE                                 0x1
#define _CWG1AS0_LSBD0_LENGTH                               0x1
#define _CWG1AS0_LSBD0_MASK                                 0x10
#define _CWG1AS0_LSBD1_POSN                                 0x5
#define _CWG1AS0_LSBD1_POSITION                             0x5
#define _CWG1AS0_LSBD1_SIZE                                 0x1
#define _CWG1AS0_LSBD1_LENGTH                               0x1
#define _CWG1AS0_LSBD1_MASK                                 0x20
#define _CWG1AS0_CWG1LSBD0_POSN                             0x4
#define _CWG1AS0_CWG1LSBD0_POSITION                         0x4
#define _CWG1AS0_CWG1LSBD0_SIZE                             0x1
#define _CWG1AS0_CWG1LSBD0_LENGTH                           0x1
#define _CWG1AS0_CWG1LSBD0_MASK                             0x10
#define _CWG1AS0_CWG1LSBD1_POSN                             0x5
#define _CWG1AS0_CWG1LSBD1_POSITION                         0x5
#define _CWG1AS0_CWG1LSBD1_SIZE                             0x1
#define _CWG1AS0_CWG1LSBD1_LENGTH                           0x1
#define _CWG1AS0_CWG1LSBD1_MASK                             0x20
#define _CWG1AS0_CWG1LSBD_POSN                              0x4
#define _CWG1AS0_CWG1LSBD_POSITION                          0x4
#define _CWG1AS0_CWG1LSBD_SIZE                              0x2
#define _CWG1AS0_CWG1LSBD_LENGTH                            0x2
#define _CWG1AS0_CWG1LSBD_MASK                              0x30

// Register: CWG1AS1
#define CWG1AS1 CWG1AS1
extern volatile unsigned char           CWG1AS1             __at(0x3C3);
#ifndef _LIB_BUILD
asm("CWG1AS1 equ 03C3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AS0E                   :1;
        unsigned AS1E                   :1;
        unsigned AS2E                   :1;
        unsigned AS3E                   :1;
        unsigned AS4E                   :1;
        unsigned AS5E                   :1;
        unsigned AS6E                   :1;
        unsigned AS7E                   :1;
    };
} CWG1AS1bits_t;
