MikroElektronika/core_packages/PIC/XC8/def/PIC18F56Q43/mcu.h
extern volatile IOCENbits_t IOCENbits __at(0x426);
// bitfield macros
#define _IOCEN_IOCEN3_POSN                                  0x3
#define _IOCEN_IOCEN3_POSITION                              0x3
#define _IOCEN_IOCEN3_SIZE                                  0x1
#define _IOCEN_IOCEN3_LENGTH                                0x1
#define _IOCEN_IOCEN3_MASK                                  0x8

// Register: IOCEF
#define IOCEF IOCEF
extern volatile unsigned char           IOCEF               __at(0x427);
#ifndef _LIB_BUILD
asm("IOCEF equ 0427h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned IOCEF3                 :1;
    };
} IOCEFbits_t;
extern volatile IOCEFbits_t IOCEFbits __at(0x427);
// bitfield macros
#define _IOCEF_IOCEF3_POSN                                  0x3
#define _IOCEF_IOCEF3_POSITION                              0x3
#define _IOCEF_IOCEF3_SIZE                                  0x1
#define _IOCEF_IOCEF3_LENGTH                                0x1
#define _IOCEF_IOCEF3_MASK                                  0x8

// Register: ANSELF
#define ANSELF ANSELF
extern volatile unsigned char           ANSELF              __at(0x428);
#ifndef _LIB_BUILD
asm("ANSELF equ 0428h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSELF0                :1;
        unsigned ANSELF1                :1;
        unsigned ANSELF2                :1;
        unsigned ANSELF3                :1;
        unsigned ANSELF4                :1;
        unsigned ANSELF5                :1;
        unsigned ANSELF6                :1;
        unsigned ANSELF7                :1;
    };
} ANSELFbits_t;
extern volatile ANSELFbits_t ANSELFbits __at(0x428);
// bitfield macros
#define _ANSELF_ANSELF0_POSN                                0x0
#define _ANSELF_ANSELF0_POSITION                            0x0
#define _ANSELF_ANSELF0_SIZE                                0x1
#define _ANSELF_ANSELF0_LENGTH                              0x1
#define _ANSELF_ANSELF0_MASK                                0x1
#define _ANSELF_ANSELF1_POSN                                0x1
#define _ANSELF_ANSELF1_POSITION                            0x1
#define _ANSELF_ANSELF1_SIZE                                0x1
#define _ANSELF_ANSELF1_LENGTH                              0x1
#define _ANSELF_ANSELF1_MASK                                0x2
#define _ANSELF_ANSELF2_POSN                                0x2
#define _ANSELF_ANSELF2_POSITION                            0x2
#define _ANSELF_ANSELF2_SIZE                                0x1
#define _ANSELF_ANSELF2_LENGTH                              0x1
#define _ANSELF_ANSELF2_MASK                                0x4
#define _ANSELF_ANSELF3_POSN                                0x3
#define _ANSELF_ANSELF3_POSITION                            0x3
#define _ANSELF_ANSELF3_SIZE                                0x1
#define _ANSELF_ANSELF3_LENGTH                              0x1
#define _ANSELF_ANSELF3_MASK                                0x8
#define _ANSELF_ANSELF4_POSN                                0x4
#define _ANSELF_ANSELF4_POSITION                            0x4
#define _ANSELF_ANSELF4_SIZE                                0x1
#define _ANSELF_ANSELF4_LENGTH                              0x1
#define _ANSELF_ANSELF4_MASK                                0x10
#define _ANSELF_ANSELF5_POSN                                0x5
#define _ANSELF_ANSELF5_POSITION                            0x5
#define _ANSELF_ANSELF5_SIZE                                0x1
#define _ANSELF_ANSELF5_LENGTH                              0x1
#define _ANSELF_ANSELF5_MASK                                0x20
#define _ANSELF_ANSELF6_POSN                                0x6
#define _ANSELF_ANSELF6_POSITION                            0x6
#define _ANSELF_ANSELF6_SIZE                                0x1
#define _ANSELF_ANSELF6_LENGTH                              0x1
#define _ANSELF_ANSELF6_MASK                                0x40
#define _ANSELF_ANSELF7_POSN                                0x7
#define _ANSELF_ANSELF7_POSITION                            0x7
#define _ANSELF_ANSELF7_SIZE                                0x1
#define _ANSELF_ANSELF7_LENGTH                              0x1
#define _ANSELF_ANSELF7_MASK                                0x80

// Register: WPUF
#define WPUF WPUF
extern volatile unsigned char           WPUF                __at(0x429);
#ifndef _LIB_BUILD
asm("WPUF equ 0429h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WPUF0                  :1;
        unsigned WPUF1                  :1;
        unsigned WPUF2                  :1;
        unsigned WPUF3                  :1;
        unsigned WPUF4                  :1;
        unsigned WPUF5                  :1;
        unsigned WPUF6                  :1;
        unsigned WPUF7                  :1;
    };
} WPUFbits_t;
extern volatile WPUFbits_t WPUFbits __at(0x429);
// bitfield macros
#define _WPUF_WPUF0_POSN                                    0x0
#define _WPUF_WPUF0_POSITION                                0x0
#define _WPUF_WPUF0_SIZE                                    0x1
#define _WPUF_WPUF0_LENGTH                                  0x1
#define _WPUF_WPUF0_MASK                                    0x1
#define _WPUF_WPUF1_POSN                                    0x1
#define _WPUF_WPUF1_POSITION                                0x1
#define _WPUF_WPUF1_SIZE                                    0x1
#define _WPUF_WPUF1_LENGTH                                  0x1
#define _WPUF_WPUF1_MASK                                    0x2
#define _WPUF_WPUF2_POSN                                    0x2
#define _WPUF_WPUF2_POSITION                                0x2
#define _WPUF_WPUF2_SIZE                                    0x1
#define _WPUF_WPUF2_LENGTH                                  0x1
#define _WPUF_WPUF2_MASK                                    0x4
#define _WPUF_WPUF3_POSN                                    0x3
#define _WPUF_WPUF3_POSITION                                0x3
#define _WPUF_WPUF3_SIZE                                    0x1
#define _WPUF_WPUF3_LENGTH                                  0x1
#define _WPUF_WPUF3_MASK                                    0x8
#define _WPUF_WPUF4_POSN                                    0x4
#define _WPUF_WPUF4_POSITION                                0x4
#define _WPUF_WPUF4_SIZE                                    0x1
#define _WPUF_WPUF4_LENGTH                                  0x1
#define _WPUF_WPUF4_MASK                                    0x10
#define _WPUF_WPUF5_POSN                                    0x5
#define _WPUF_WPUF5_POSITION                                0x5
#define _WPUF_WPUF5_SIZE                                    0x1
#define _WPUF_WPUF5_LENGTH                                  0x1
#define _WPUF_WPUF5_MASK                                    0x20
#define _WPUF_WPUF6_POSN                                    0x6
#define _WPUF_WPUF6_POSITION                                0x6
#define _WPUF_WPUF6_SIZE                                    0x1
#define _WPUF_WPUF6_LENGTH                                  0x1
#define _WPUF_WPUF6_MASK                                    0x40
#define _WPUF_WPUF7_POSN                                    0x7
#define _WPUF_WPUF7_POSITION                                0x7
#define _WPUF_WPUF7_SIZE                                    0x1
#define _WPUF_WPUF7_LENGTH                                  0x1
#define _WPUF_WPUF7_MASK                                    0x80

