MikroElektronika/core_packages/PIC/XC8/def/PIC18F56Q43/mcu.h
extern volatile PWM3S1P1Lbits_t PWM3S1P1Lbits __at(0x489);
// bitfield macros
#define _PWM3S1P1L_S1P1L_POSN                               0x0
#define _PWM3S1P1L_S1P1L_POSITION                           0x0
#define _PWM3S1P1L_S1P1L_SIZE                               0x8
#define _PWM3S1P1L_S1P1L_LENGTH                             0x8
#define _PWM3S1P1L_S1P1L_MASK                               0xFF

// Register: PWM3S1P1H
#define PWM3S1P1H PWM3S1P1H
extern volatile unsigned char           PWM3S1P1H           __at(0x48A);
#ifndef _LIB_BUILD
asm("PWM3S1P1H equ 048Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P1H                  :8;
    };
} PWM3S1P1Hbits_t;
extern volatile PWM3S1P1Hbits_t PWM3S1P1Hbits __at(0x48A);
// bitfield macros
#define _PWM3S1P1H_S1P1H_POSN                               0x0
#define _PWM3S1P1H_S1P1H_POSITION                           0x0
#define _PWM3S1P1H_S1P1H_SIZE                               0x8
#define _PWM3S1P1H_S1P1H_LENGTH                             0x8
#define _PWM3S1P1H_S1P1H_MASK                               0xFF

// Register: PWM3S1P2
#define PWM3S1P2 PWM3S1P2
extern volatile unsigned short          PWM3S1P2            __at(0x48B);
#ifndef _LIB_BUILD
asm("PWM3S1P2 equ 048Bh");
#endif

// Register: PWM3S1P2L
#define PWM3S1P2L PWM3S1P2L
extern volatile unsigned char           PWM3S1P2L           __at(0x48B);
#ifndef _LIB_BUILD
asm("PWM3S1P2L equ 048Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P2L                  :8;
    };
} PWM3S1P2Lbits_t;
extern volatile PWM3S1P2Lbits_t PWM3S1P2Lbits __at(0x48B);
// bitfield macros
#define _PWM3S1P2L_S1P2L_POSN                               0x0
#define _PWM3S1P2L_S1P2L_POSITION                           0x0
#define _PWM3S1P2L_S1P2L_SIZE                               0x8
#define _PWM3S1P2L_S1P2L_LENGTH                             0x8
#define _PWM3S1P2L_S1P2L_MASK                               0xFF

// Register: PWM3S1P2H
#define PWM3S1P2H PWM3S1P2H
extern volatile unsigned char           PWM3S1P2H           __at(0x48C);
#ifndef _LIB_BUILD
asm("PWM3S1P2H equ 048Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P2H                  :8;
    };
} PWM3S1P2Hbits_t;
extern volatile PWM3S1P2Hbits_t PWM3S1P2Hbits __at(0x48C);
// bitfield macros
#define _PWM3S1P2H_S1P2H_POSN                               0x0
#define _PWM3S1P2H_S1P2H_POSITION                           0x0
#define _PWM3S1P2H_S1P2H_SIZE                               0x8
#define _PWM3S1P2H_S1P2H_LENGTH                             0x8
#define _PWM3S1P2H_S1P2H_MASK                               0xFF

// Register: PWMLOAD
#define PWMLOAD PWMLOAD
extern volatile unsigned char           PWMLOAD             __at(0x49C);
#ifndef _LIB_BUILD
asm("PWMLOAD equ 049Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MPWM1LD                :1;
        unsigned MPWM2LD                :1;
        unsigned MPWM3LD                :1;
    };
} PWMLOADbits_t;
extern volatile PWMLOADbits_t PWMLOADbits __at(0x49C);
// bitfield macros
#define _PWMLOAD_MPWM1LD_POSN                               0x0
#define _PWMLOAD_MPWM1LD_POSITION                           0x0
#define _PWMLOAD_MPWM1LD_SIZE                               0x1
#define _PWMLOAD_MPWM1LD_LENGTH                             0x1
#define _PWMLOAD_MPWM1LD_MASK                               0x1
#define _PWMLOAD_MPWM2LD_POSN                               0x1
#define _PWMLOAD_MPWM2LD_POSITION                           0x1
#define _PWMLOAD_MPWM2LD_SIZE                               0x1
#define _PWMLOAD_MPWM2LD_LENGTH                             0x1
#define _PWMLOAD_MPWM2LD_MASK                               0x2
#define _PWMLOAD_MPWM3LD_POSN                               0x2
#define _PWMLOAD_MPWM3LD_POSITION                           0x2
#define _PWMLOAD_MPWM3LD_SIZE                               0x1
#define _PWMLOAD_MPWM3LD_LENGTH                             0x1
#define _PWMLOAD_MPWM3LD_MASK                               0x4

// Register: PWMEN
#define PWMEN PWMEN
extern volatile unsigned char           PWMEN               __at(0x49D);
#ifndef _LIB_BUILD
asm("PWMEN equ 049Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MPWM1EN                :1;
        unsigned MPWM2EN                :1;
        unsigned MPWM3EN                :1;
    };
} PWMENbits_t;
extern volatile PWMENbits_t PWMENbits __at(0x49D);
// bitfield macros
#define _PWMEN_MPWM1EN_POSN                                 0x0
#define _PWMEN_MPWM1EN_POSITION                             0x0
#define _PWMEN_MPWM1EN_SIZE                                 0x1
#define _PWMEN_MPWM1EN_LENGTH                               0x1
#define _PWMEN_MPWM1EN_MASK                                 0x1
#define _PWMEN_MPWM2EN_POSN                                 0x1
#define _PWMEN_MPWM2EN_POSITION                             0x1
#define _PWMEN_MPWM2EN_SIZE                                 0x1
#define _PWMEN_MPWM2EN_LENGTH                               0x1
#define _PWMEN_MPWM2EN_MASK                                 0x2
#define _PWMEN_MPWM3EN_POSN                                 0x2
#define _PWMEN_MPWM3EN_POSITION                             0x2
#define _PWMEN_MPWM3EN_SIZE                                 0x1
#define _PWMEN_MPWM3EN_LENGTH                               0x1
#define _PWMEN_MPWM3EN_MASK                                 0x4

// Register: PIE0
#define PIE0 PIE0
extern volatile unsigned char           PIE0                __at(0x49E);
#ifndef _LIB_BUILD
asm("PIE0 equ 049Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SWIE                   :1;
        unsigned HLVDIE                 :1;
        unsigned OSFIE                  :1;
        unsigned CSWIE                  :1;
        unsigned                        :1;
        unsigned CLC1IE                 :1;
        unsigned                        :1;
        unsigned IOCIE                  :1;
    };
} PIE0bits_t;
extern volatile PIE0bits_t PIE0bits __at(0x49E);
// bitfield macros
#define _PIE0_SWIE_POSN                                     0x0
#define _PIE0_SWIE_POSITION                                 0x0
#define _PIE0_SWIE_SIZE                                     0x1
#define _PIE0_SWIE_LENGTH                                   0x1
#define _PIE0_SWIE_MASK                                     0x1
#define _PIE0_HLVDIE_POSN                                   0x1
#define _PIE0_HLVDIE_POSITION                               0x1
#define _PIE0_HLVDIE_SIZE                                   0x1
#define _PIE0_HLVDIE_LENGTH                                 0x1
#define _PIE0_HLVDIE_MASK                                   0x2
#define _PIE0_OSFIE_POSN                                    0x2
#define _PIE0_OSFIE_POSITION                                0x2
#define _PIE0_OSFIE_SIZE                                    0x1
#define _PIE0_OSFIE_LENGTH                                  0x1
#define _PIE0_OSFIE_MASK                                    0x4
#define _PIE0_CSWIE_POSN                                    0x3
#define _PIE0_CSWIE_POSITION                                0x3
#define _PIE0_CSWIE_SIZE                                    0x1
#define _PIE0_CSWIE_LENGTH                                  0x1
#define _PIE0_CSWIE_MASK                                    0x8
#define _PIE0_CLC1IE_POSN                                   0x5
#define _PIE0_CLC1IE_POSITION                               0x5
#define _PIE0_CLC1IE_SIZE                                   0x1
#define _PIE0_CLC1IE_LENGTH                                 0x1
#define _PIE0_CLC1IE_MASK                                   0x20
#define _PIE0_IOCIE_POSN                                    0x7
#define _PIE0_IOCIE_POSITION                                0x7
#define _PIE0_IOCIE_SIZE                                    0x1
#define _PIE0_IOCIE_LENGTH                                  0x1
#define _PIE0_IOCIE_MASK                                    0x80

// Register: PIE1
#define PIE1 PIE1
extern volatile unsigned char           PIE1                __at(0x49F);
#ifndef _LIB_BUILD
asm("PIE1 equ 049Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0IE                 :1;
        unsigned ZCDIE                  :1;
        unsigned ADIE                   :1;
        unsigned ACTIE                  :1;
        unsigned C1IE                   :1;
        unsigned SMT1IE                 :1;
        unsigned SMT1PRAIE              :1;
        unsigned SMT1PWAIE              :1;
    };
} PIE1bits_t;
extern volatile PIE1bits_t PIE1bits __at(0x49F);
// bitfield macros
#define _PIE1_INT0IE_POSN                                   0x0
#define _PIE1_INT0IE_POSITION                               0x0
#define _PIE1_INT0IE_SIZE                                   0x1
#define _PIE1_INT0IE_LENGTH                                 0x1
#define _PIE1_INT0IE_MASK                                   0x1
#define _PIE1_ZCDIE_POSN                                    0x1
#define _PIE1_ZCDIE_POSITION                                0x1
#define _PIE1_ZCDIE_SIZE                                    0x1
#define _PIE1_ZCDIE_LENGTH                                  0x1
#define _PIE1_ZCDIE_MASK                                    0x2
#define _PIE1_ADIE_POSN                                     0x2
#define _PIE1_ADIE_POSITION                                 0x2
#define _PIE1_ADIE_SIZE                                     0x1
#define _PIE1_ADIE_LENGTH                                   0x1
#define _PIE1_ADIE_MASK                                     0x4
#define _PIE1_ACTIE_POSN                                    0x3
#define _PIE1_ACTIE_POSITION                                0x3
#define _PIE1_ACTIE_SIZE                                    0x1
#define _PIE1_ACTIE_LENGTH                                  0x1
#define _PIE1_ACTIE_MASK                                    0x8
#define _PIE1_C1IE_POSN                                     0x4
#define _PIE1_C1IE_POSITION                                 0x4
#define _PIE1_C1IE_SIZE                                     0x1
#define _PIE1_C1IE_LENGTH                                   0x1
#define _PIE1_C1IE_MASK                                     0x10
#define _PIE1_SMT1IE_POSN                                   0x5
#define _PIE1_SMT1IE_POSITION                               0x5
#define _PIE1_SMT1IE_SIZE                                   0x1
#define _PIE1_SMT1IE_LENGTH                                 0x1
#define _PIE1_SMT1IE_MASK                                   0x20
#define _PIE1_SMT1PRAIE_POSN                                0x6
#define _PIE1_SMT1PRAIE_POSITION                            0x6
#define _PIE1_SMT1PRAIE_SIZE                                0x1
#define _PIE1_SMT1PRAIE_LENGTH                              0x1
#define _PIE1_SMT1PRAIE_MASK                                0x40
#define _PIE1_SMT1PWAIE_POSN                                0x7
#define _PIE1_SMT1PWAIE_POSITION                            0x7
#define _PIE1_SMT1PWAIE_SIZE                                0x1
#define _PIE1_SMT1PWAIE_LENGTH                              0x1
#define _PIE1_SMT1PWAIE_MASK                                0x80

// Register: PIE2
#define PIE2 PIE2
extern volatile unsigned char           PIE2                __at(0x4A0);
#ifndef _LIB_BUILD
asm("PIE2 equ 04A0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADTIE                  :1;
        unsigned                        :3;
        unsigned DMA1SCNTIE             :1;
        unsigned DMA1DCNTIE             :1;
        unsigned DMA1ORIE               :1;
        unsigned DMA1AIE                :1;
    };
} PIE2bits_t;
extern volatile PIE2bits_t PIE2bits __at(0x4A0);
// bitfield macros
#define _PIE2_ADTIE_POSN                                    0x0
#define _PIE2_ADTIE_POSITION                                0x0
#define _PIE2_ADTIE_SIZE                                    0x1
#define _PIE2_ADTIE_LENGTH                                  0x1
#define _PIE2_ADTIE_MASK                                    0x1
#define _PIE2_DMA1SCNTIE_POSN                               0x4
#define _PIE2_DMA1SCNTIE_POSITION                           0x4
#define _PIE2_DMA1SCNTIE_SIZE                               0x1
#define _PIE2_DMA1SCNTIE_LENGTH                             0x1
#define _PIE2_DMA1SCNTIE_MASK                               0x10
#define _PIE2_DMA1DCNTIE_POSN                               0x5
#define _PIE2_DMA1DCNTIE_POSITION                           0x5
#define _PIE2_DMA1DCNTIE_SIZE                               0x1
#define _PIE2_DMA1DCNTIE_LENGTH                             0x1
#define _PIE2_DMA1DCNTIE_MASK                               0x20
#define _PIE2_DMA1ORIE_POSN                                 0x6
#define _PIE2_DMA1ORIE_POSITION                             0x6
#define _PIE2_DMA1ORIE_SIZE                                 0x1
#define _PIE2_DMA1ORIE_LENGTH                               0x1
#define _PIE2_DMA1ORIE_MASK                                 0x40
#define _PIE2_DMA1AIE_POSN                                  0x7
#define _PIE2_DMA1AIE_POSITION                              0x7
#define _PIE2_DMA1AIE_SIZE                                  0x1
#define _PIE2_DMA1AIE_LENGTH                                0x1
#define _PIE2_DMA1AIE_MASK                                  0x80

// Register: PIE3
#define PIE3 PIE3
extern volatile unsigned char           PIE3                __at(0x4A1);
#ifndef _LIB_BUILD
asm("PIE3 equ 04A1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI1RXIE               :1;
        unsigned SPI1TXIE               :1;
        unsigned SPI1IE                 :1;
        unsigned TMR2IE                 :1;
        unsigned TMR1IE                 :1;
        unsigned TMR1GIE                :1;
        unsigned CCP1IE                 :1;
        unsigned TMR0IE                 :1;
    };
} PIE3bits_t;
