MikroElektronika/core_packages/PIC/XC8/def/PIC18F56Q43/mcu.h
#define                                 RE0PPS1_bit         _BIT_ACCESS(RE0PPS,1)
// RE0PPS<RE0PPS2>
extern volatile __bit                   RE0PPS2             __at(0x110A);	// @ (0x221 * 8 + 2)
#define                                 RE0PPS2_bit         _BIT_ACCESS(RE0PPS,2)
// RE0PPS<RE0PPS3>
extern volatile __bit                   RE0PPS3             __at(0x110B);	// @ (0x221 * 8 + 3)
#define                                 RE0PPS3_bit         _BIT_ACCESS(RE0PPS,3)
// RE0PPS<RE0PPS4>
extern volatile __bit                   RE0PPS4             __at(0x110C);	// @ (0x221 * 8 + 4)
#define                                 RE0PPS4_bit         _BIT_ACCESS(RE0PPS,4)
// RE0PPS<RE0PPS5>
extern volatile __bit                   RE0PPS5             __at(0x110D);	// @ (0x221 * 8 + 5)
#define                                 RE0PPS5_bit         _BIT_ACCESS(RE0PPS,5)
// RE0PPS<RE0PPS6>
extern volatile __bit                   RE0PPS6             __at(0x110E);	// @ (0x221 * 8 + 6)
#define                                 RE0PPS6_bit         _BIT_ACCESS(RE0PPS,6)
// PORTE<RE1>
extern volatile __bit                   RE1                 __at(0x2691);	// @ (0x4D2 * 8 + 1)
#define                                 RE1_bit             _BIT_ACCESS(PORTE,1)
// RE1PPS<RE1PPS0>
extern volatile __bit                   RE1PPS0             __at(0x1110);	// @ (0x222 * 8 + 0)
#define                                 RE1PPS0_bit         _BIT_ACCESS(RE1PPS,0)
// RE1PPS<RE1PPS1>
extern volatile __bit                   RE1PPS1             __at(0x1111);	// @ (0x222 * 8 + 1)
#define                                 RE1PPS1_bit         _BIT_ACCESS(RE1PPS,1)
// RE1PPS<RE1PPS2>
extern volatile __bit                   RE1PPS2             __at(0x1112);	// @ (0x222 * 8 + 2)
#define                                 RE1PPS2_bit         _BIT_ACCESS(RE1PPS,2)
// RE1PPS<RE1PPS3>
extern volatile __bit                   RE1PPS3             __at(0x1113);	// @ (0x222 * 8 + 3)
#define                                 RE1PPS3_bit         _BIT_ACCESS(RE1PPS,3)
// RE1PPS<RE1PPS4>
extern volatile __bit                   RE1PPS4             __at(0x1114);	// @ (0x222 * 8 + 4)
#define                                 RE1PPS4_bit         _BIT_ACCESS(RE1PPS,4)
// RE1PPS<RE1PPS5>
extern volatile __bit                   RE1PPS5             __at(0x1115);	// @ (0x222 * 8 + 5)
#define                                 RE1PPS5_bit         _BIT_ACCESS(RE1PPS,5)
// RE1PPS<RE1PPS6>
extern volatile __bit                   RE1PPS6             __at(0x1116);	// @ (0x222 * 8 + 6)
#define                                 RE1PPS6_bit         _BIT_ACCESS(RE1PPS,6)
// PORTE<RE2>
extern volatile __bit                   RE2                 __at(0x2692);	// @ (0x4D2 * 8 + 2)
#define                                 RE2_bit             _BIT_ACCESS(PORTE,2)
// RE2PPS<RE2PPS0>
extern volatile __bit                   RE2PPS0             __at(0x1118);	// @ (0x223 * 8 + 0)
#define                                 RE2PPS0_bit         _BIT_ACCESS(RE2PPS,0)
// RE2PPS<RE2PPS1>
extern volatile __bit                   RE2PPS1             __at(0x1119);	// @ (0x223 * 8 + 1)
#define                                 RE2PPS1_bit         _BIT_ACCESS(RE2PPS,1)
// RE2PPS<RE2PPS2>
extern volatile __bit                   RE2PPS2             __at(0x111A);	// @ (0x223 * 8 + 2)
#define                                 RE2PPS2_bit         _BIT_ACCESS(RE2PPS,2)
// RE2PPS<RE2PPS3>
extern volatile __bit                   RE2PPS3             __at(0x111B);	// @ (0x223 * 8 + 3)
#define                                 RE2PPS3_bit         _BIT_ACCESS(RE2PPS,3)
// RE2PPS<RE2PPS4>
extern volatile __bit                   RE2PPS4             __at(0x111C);	// @ (0x223 * 8 + 4)
#define                                 RE2PPS4_bit         _BIT_ACCESS(RE2PPS,4)
// RE2PPS<RE2PPS5>
extern volatile __bit                   RE2PPS5             __at(0x111D);	// @ (0x223 * 8 + 5)
#define                                 RE2PPS5_bit         _BIT_ACCESS(RE2PPS,5)
// RE2PPS<RE2PPS6>
extern volatile __bit                   RE2PPS6             __at(0x111E);	// @ (0x223 * 8 + 6)
#define                                 RE2PPS6_bit         _BIT_ACCESS(RE2PPS,6)
// PORTE<RE3>
extern volatile __bit                   RE3                 __at(0x2693);	// @ (0x4D2 * 8 + 3)
#define                                 RE3_bit             _BIT_ACCESS(PORTE,3)
// I2C1STAT0<READ>
extern volatile __bit                   READ                __at(0x14C4);	// @ (0x298 * 8 + 4)
#define                                 READ_bit            _BIT_ACCESS(I2C1STAT0,4)
// SMT1CON1<REPEAT>
extern volatile __bit                   REPEAT              __at(0x186E);	// @ (0x30D * 8 + 6)
#define                                 REPEAT_bit          _BIT_ACCESS(SMT1CON1,6)
// ADRESL<RES0>
extern volatile __bit                   RES0                __at(0x1F50);	// @ (0x3EA * 8 + 0)
#define                                 RES0_bit            _BIT_ACCESS(ADRESL,0)
// ADRESL<RES1>
extern volatile __bit                   RES1                __at(0x1F51);	// @ (0x3EA * 8 + 1)
#define                                 RES1_bit            _BIT_ACCESS(ADRESL,1)
// ADRESH<RES10>
extern volatile __bit                   RES10               __at(0x1F5A);	// @ (0x3EB * 8 + 2)
#define                                 RES10_bit           _BIT_ACCESS(ADRESH,2)
// ADRESH<RES11>
extern volatile __bit                   RES11               __at(0x1F5B);	// @ (0x3EB * 8 + 3)
#define                                 RES11_bit           _BIT_ACCESS(ADRESH,3)
// ADRESH<RES12>
extern volatile __bit                   RES12               __at(0x1F5C);	// @ (0x3EB * 8 + 4)
#define                                 RES12_bit           _BIT_ACCESS(ADRESH,4)
// ADRESH<RES13>
extern volatile __bit                   RES13               __at(0x1F5D);	// @ (0x3EB * 8 + 5)
#define                                 RES13_bit           _BIT_ACCESS(ADRESH,5)
// ADRESH<RES14>
extern volatile __bit                   RES14               __at(0x1F5E);	// @ (0x3EB * 8 + 6)
#define                                 RES14_bit           _BIT_ACCESS(ADRESH,6)
// ADRESH<RES15>
extern volatile __bit                   RES15               __at(0x1F5F);	// @ (0x3EB * 8 + 7)
#define                                 RES15_bit           _BIT_ACCESS(ADRESH,7)
// ADRESL<RES2>
extern volatile __bit                   RES2                __at(0x1F52);	// @ (0x3EA * 8 + 2)
#define                                 RES2_bit            _BIT_ACCESS(ADRESL,2)
// ADRESL<RES3>
extern volatile __bit                   RES3                __at(0x1F53);	// @ (0x3EA * 8 + 3)
#define                                 RES3_bit            _BIT_ACCESS(ADRESL,3)
// ADRESL<RES4>
extern volatile __bit                   RES4                __at(0x1F54);	// @ (0x3EA * 8 + 4)
#define                                 RES4_bit            _BIT_ACCESS(ADRESL,4)
// ADRESL<RES5>
extern volatile __bit                   RES5                __at(0x1F55);	// @ (0x3EA * 8 + 5)
#define                                 RES5_bit            _BIT_ACCESS(ADRESL,5)
// ADRESL<RES6>
extern volatile __bit                   RES6                __at(0x1F56);	// @ (0x3EA * 8 + 6)
#define                                 RES6_bit            _BIT_ACCESS(ADRESL,6)
// ADRESL<RES7>
extern volatile __bit                   RES7                __at(0x1F57);	// @ (0x3EA * 8 + 7)
#define                                 RES7_bit            _BIT_ACCESS(ADRESL,7)
// ADRESH<RES8>
extern volatile __bit                   RES8                __at(0x1F58);	// @ (0x3EB * 8 + 0)
#define                                 RES8_bit            _BIT_ACCESS(ADRESH,0)
// ADRESH<RES9>
extern volatile __bit                   RES9                __at(0x1F59);	// @ (0x3EB * 8 + 1)
#define                                 RES9_bit            _BIT_ACCESS(ADRESH,1)
// PORTF<RF0>
extern volatile __bit                   RF0                 __at(0x2698);	// @ (0x4D3 * 8 + 0)
#define                                 RF0_bit             _BIT_ACCESS(PORTF,0)
// RF0PPS<RF0PPS0>
extern volatile __bit                   RF0PPS0             __at(0x1148);	// @ (0x229 * 8 + 0)
#define                                 RF0PPS0_bit         _BIT_ACCESS(RF0PPS,0)
// RF0PPS<RF0PPS1>
extern volatile __bit                   RF0PPS1             __at(0x1149);	// @ (0x229 * 8 + 1)
#define                                 RF0PPS1_bit         _BIT_ACCESS(RF0PPS,1)
// RF0PPS<RF0PPS2>
extern volatile __bit                   RF0PPS2             __at(0x114A);	// @ (0x229 * 8 + 2)
#define                                 RF0PPS2_bit         _BIT_ACCESS(RF0PPS,2)
// RF0PPS<RF0PPS3>
extern volatile __bit                   RF0PPS3             __at(0x114B);	// @ (0x229 * 8 + 3)
#define                                 RF0PPS3_bit         _BIT_ACCESS(RF0PPS,3)
// RF0PPS<RF0PPS4>
extern volatile __bit                   RF0PPS4             __at(0x114C);	// @ (0x229 * 8 + 4)
#define                                 RF0PPS4_bit         _BIT_ACCESS(RF0PPS,4)
// RF0PPS<RF0PPS5>
extern volatile __bit                   RF0PPS5             __at(0x114D);	// @ (0x229 * 8 + 5)
#define                                 RF0PPS5_bit         _BIT_ACCESS(RF0PPS,5)
// RF0PPS<RF0PPS6>
extern volatile __bit                   RF0PPS6             __at(0x114E);	// @ (0x229 * 8 + 6)
#define                                 RF0PPS6_bit         _BIT_ACCESS(RF0PPS,6)
// PORTF<RF1>
extern volatile __bit                   RF1                 __at(0x2699);	// @ (0x4D3 * 8 + 1)
#define                                 RF1_bit             _BIT_ACCESS(PORTF,1)
// RF1PPS<RF1PPS0>
extern volatile __bit                   RF1PPS0             __at(0x1150);	// @ (0x22A * 8 + 0)
#define                                 RF1PPS0_bit         _BIT_ACCESS(RF1PPS,0)
// RF1PPS<RF1PPS1>
extern volatile __bit                   RF1PPS1             __at(0x1151);	// @ (0x22A * 8 + 1)
#define                                 RF1PPS1_bit         _BIT_ACCESS(RF1PPS,1)
// RF1PPS<RF1PPS2>
extern volatile __bit                   RF1PPS2             __at(0x1152);	// @ (0x22A * 8 + 2)
#define                                 RF1PPS2_bit         _BIT_ACCESS(RF1PPS,2)
// RF1PPS<RF1PPS3>
extern volatile __bit                   RF1PPS3             __at(0x1153);	// @ (0x22A * 8 + 3)
#define                                 RF1PPS3_bit         _BIT_ACCESS(RF1PPS,3)
// RF1PPS<RF1PPS4>
extern volatile __bit                   RF1PPS4             __at(0x1154);	// @ (0x22A * 8 + 4)
#define                                 RF1PPS4_bit         _BIT_ACCESS(RF1PPS,4)
// RF1PPS<RF1PPS5>
extern volatile __bit                   RF1PPS5             __at(0x1155);	// @ (0x22A * 8 + 5)
#define                                 RF1PPS5_bit         _BIT_ACCESS(RF1PPS,5)
// RF1PPS<RF1PPS6>
extern volatile __bit                   RF1PPS6             __at(0x1156);	// @ (0x22A * 8 + 6)
#define                                 RF1PPS6_bit         _BIT_ACCESS(RF1PPS,6)
// PORTF<RF2>
extern volatile __bit                   RF2                 __at(0x269A);	// @ (0x4D3 * 8 + 2)
#define                                 RF2_bit             _BIT_ACCESS(PORTF,2)
// RF2PPS<RF2PPS0>
extern volatile __bit                   RF2PPS0             __at(0x1158);	// @ (0x22B * 8 + 0)
#define                                 RF2PPS0_bit         _BIT_ACCESS(RF2PPS,0)
// RF2PPS<RF2PPS1>
extern volatile __bit                   RF2PPS1             __at(0x1159);	// @ (0x22B * 8 + 1)
#define                                 RF2PPS1_bit         _BIT_ACCESS(RF2PPS,1)
// RF2PPS<RF2PPS2>
extern volatile __bit                   RF2PPS2             __at(0x115A);	// @ (0x22B * 8 + 2)
#define                                 RF2PPS2_bit         _BIT_ACCESS(RF2PPS,2)
// RF2PPS<RF2PPS3>
extern volatile __bit                   RF2PPS3             __at(0x115B);	// @ (0x22B * 8 + 3)
#define                                 RF2PPS3_bit         _BIT_ACCESS(RF2PPS,3)
// RF2PPS<RF2PPS4>
extern volatile __bit                   RF2PPS4             __at(0x115C);	// @ (0x22B * 8 + 4)
#define                                 RF2PPS4_bit         _BIT_ACCESS(RF2PPS,4)
// RF2PPS<RF2PPS5>
extern volatile __bit                   RF2PPS5             __at(0x115D);	// @ (0x22B * 8 + 5)
#define                                 RF2PPS5_bit         _BIT_ACCESS(RF2PPS,5)
// RF2PPS<RF2PPS6>
extern volatile __bit                   RF2PPS6             __at(0x115E);	// @ (0x22B * 8 + 6)
#define                                 RF2PPS6_bit         _BIT_ACCESS(RF2PPS,6)
// PORTF<RF3>
extern volatile __bit                   RF3                 __at(0x269B);	// @ (0x4D3 * 8 + 3)
#define                                 RF3_bit             _BIT_ACCESS(PORTF,3)
// RF3PPS<RF3PPS0>
extern volatile __bit                   RF3PPS0             __at(0x1160);	// @ (0x22C * 8 + 0)
#define                                 RF3PPS0_bit         _BIT_ACCESS(RF3PPS,0)
// RF3PPS<RF3PPS1>
extern volatile __bit                   RF3PPS1             __at(0x1161);	// @ (0x22C * 8 + 1)
#define                                 RF3PPS1_bit         _BIT_ACCESS(RF3PPS,1)
// RF3PPS<RF3PPS2>
extern volatile __bit                   RF3PPS2             __at(0x1162);	// @ (0x22C * 8 + 2)
#define                                 RF3PPS2_bit         _BIT_ACCESS(RF3PPS,2)
// RF3PPS<RF3PPS3>
extern volatile __bit                   RF3PPS3             __at(0x1163);	// @ (0x22C * 8 + 3)
#define                                 RF3PPS3_bit         _BIT_ACCESS(RF3PPS,3)
// RF3PPS<RF3PPS4>
extern volatile __bit                   RF3PPS4             __at(0x1164);	// @ (0x22C * 8 + 4)
#define                                 RF3PPS4_bit         _BIT_ACCESS(RF3PPS,4)
// RF3PPS<RF3PPS5>
extern volatile __bit                   RF3PPS5             __at(0x1165);	// @ (0x22C * 8 + 5)
#define                                 RF3PPS5_bit         _BIT_ACCESS(RF3PPS,5)
// RF3PPS<RF3PPS6>
extern volatile __bit                   RF3PPS6             __at(0x1166);	// @ (0x22C * 8 + 6)
#define                                 RF3PPS6_bit         _BIT_ACCESS(RF3PPS,6)
// PORTF<RF4>
extern volatile __bit                   RF4                 __at(0x269C);	// @ (0x4D3 * 8 + 4)
#define                                 RF4_bit             _BIT_ACCESS(PORTF,4)
// RF4PPS<RF4PPS0>
extern volatile __bit                   RF4PPS0             __at(0x1168);	// @ (0x22D * 8 + 0)
#define                                 RF4PPS0_bit         _BIT_ACCESS(RF4PPS,0)
// RF4PPS<RF4PPS1>
extern volatile __bit                   RF4PPS1             __at(0x1169);	// @ (0x22D * 8 + 1)
#define                                 RF4PPS1_bit         _BIT_ACCESS(RF4PPS,1)
// RF4PPS<RF4PPS2>
extern volatile __bit                   RF4PPS2             __at(0x116A);	// @ (0x22D * 8 + 2)
#define                                 RF4PPS2_bit         _BIT_ACCESS(RF4PPS,2)
// RF4PPS<RF4PPS3>
extern volatile __bit                   RF4PPS3             __at(0x116B);	// @ (0x22D * 8 + 3)
#define                                 RF4PPS3_bit         _BIT_ACCESS(RF4PPS,3)
// RF4PPS<RF4PPS4>
extern volatile __bit                   RF4PPS4             __at(0x116C);	// @ (0x22D * 8 + 4)
#define                                 RF4PPS4_bit         _BIT_ACCESS(RF4PPS,4)
// RF4PPS<RF4PPS5>
extern volatile __bit                   RF4PPS5             __at(0x116D);	// @ (0x22D * 8 + 5)
#define                                 RF4PPS5_bit         _BIT_ACCESS(RF4PPS,5)
// RF4PPS<RF4PPS6>
extern volatile __bit                   RF4PPS6             __at(0x116E);	// @ (0x22D * 8 + 6)
#define                                 RF4PPS6_bit         _BIT_ACCESS(RF4PPS,6)
// PORTF<RF5>
extern volatile __bit                   RF5                 __at(0x269D);	// @ (0x4D3 * 8 + 5)
#define                                 RF5_bit             _BIT_ACCESS(PORTF,5)
// RF5PPS<RF5PPS0>
extern volatile __bit                   RF5PPS0             __at(0x1170);	// @ (0x22E * 8 + 0)
#define                                 RF5PPS0_bit         _BIT_ACCESS(RF5PPS,0)
// RF5PPS<RF5PPS1>
extern volatile __bit                   RF5PPS1             __at(0x1171);	// @ (0x22E * 8 + 1)
#define                                 RF5PPS1_bit         _BIT_ACCESS(RF5PPS,1)
// RF5PPS<RF5PPS2>
extern volatile __bit                   RF5PPS2             __at(0x1172);	// @ (0x22E * 8 + 2)
#define                                 RF5PPS2_bit         _BIT_ACCESS(RF5PPS,2)
// RF5PPS<RF5PPS3>
extern volatile __bit                   RF5PPS3             __at(0x1173);	// @ (0x22E * 8 + 3)
#define                                 RF5PPS3_bit         _BIT_ACCESS(RF5PPS,3)
// RF5PPS<RF5PPS4>
extern volatile __bit                   RF5PPS4             __at(0x1174);	// @ (0x22E * 8 + 4)
#define                                 RF5PPS4_bit         _BIT_ACCESS(RF5PPS,4)
// RF5PPS<RF5PPS5>
extern volatile __bit                   RF5PPS5             __at(0x1175);	// @ (0x22E * 8 + 5)
#define                                 RF5PPS5_bit         _BIT_ACCESS(RF5PPS,5)
// RF5PPS<RF5PPS6>
extern volatile __bit                   RF5PPS6             __at(0x1176);	// @ (0x22E * 8 + 6)
#define                                 RF5PPS6_bit         _BIT_ACCESS(RF5PPS,6)
// PORTF<RF6>
extern volatile __bit                   RF6                 __at(0x269E);	// @ (0x4D3 * 8 + 6)
#define                                 RF6_bit             _BIT_ACCESS(PORTF,6)
// RF6PPS<RF6PPS0>
extern volatile __bit                   RF6PPS0             __at(0x1178);	// @ (0x22F * 8 + 0)
#define                                 RF6PPS0_bit         _BIT_ACCESS(RF6PPS,0)
// RF6PPS<RF6PPS1>
extern volatile __bit                   RF6PPS1             __at(0x1179);	// @ (0x22F * 8 + 1)
#define                                 RF6PPS1_bit         _BIT_ACCESS(RF6PPS,1)
// RF6PPS<RF6PPS2>
extern volatile __bit                   RF6PPS2             __at(0x117A);	// @ (0x22F * 8 + 2)
#define                                 RF6PPS2_bit         _BIT_ACCESS(RF6PPS,2)
// RF6PPS<RF6PPS3>
extern volatile __bit                   RF6PPS3             __at(0x117B);	// @ (0x22F * 8 + 3)
#define                                 RF6PPS3_bit         _BIT_ACCESS(RF6PPS,3)
// RF6PPS<RF6PPS4>
extern volatile __bit                   RF6PPS4             __at(0x117C);	// @ (0x22F * 8 + 4)
#define                                 RF6PPS4_bit         _BIT_ACCESS(RF6PPS,4)
// RF6PPS<RF6PPS5>
extern volatile __bit                   RF6PPS5             __at(0x117D);	// @ (0x22F * 8 + 5)
#define                                 RF6PPS5_bit         _BIT_ACCESS(RF6PPS,5)
// RF6PPS<RF6PPS6>
extern volatile __bit                   RF6PPS6             __at(0x117E);	// @ (0x22F * 8 + 6)
#define                                 RF6PPS6_bit         _BIT_ACCESS(RF6PPS,6)
// PORTF<RF7>
extern volatile __bit                   RF7                 __at(0x269F);	// @ (0x4D3 * 8 + 7)
#define                                 RF7_bit             _BIT_ACCESS(PORTF,7)
// RF7PPS<RF7PPS0>
extern volatile __bit                   RF7PPS0             __at(0x1180);	// @ (0x230 * 8 + 0)
#define                                 RF7PPS0_bit         _BIT_ACCESS(RF7PPS,0)
// RF7PPS<RF7PPS1>
extern volatile __bit                   RF7PPS1             __at(0x1181);	// @ (0x230 * 8 + 1)
#define                                 RF7PPS1_bit         _BIT_ACCESS(RF7PPS,1)
// RF7PPS<RF7PPS2>
extern volatile __bit                   RF7PPS2             __at(0x1182);	// @ (0x230 * 8 + 2)
#define                                 RF7PPS2_bit         _BIT_ACCESS(RF7PPS,2)
// RF7PPS<RF7PPS3>
extern volatile __bit                   RF7PPS3             __at(0x1183);	// @ (0x230 * 8 + 3)
#define                                 RF7PPS3_bit         _BIT_ACCESS(RF7PPS,3)
// RF7PPS<RF7PPS4>
extern volatile __bit                   RF7PPS4             __at(0x1184);	// @ (0x230 * 8 + 4)
#define                                 RF7PPS4_bit         _BIT_ACCESS(RF7PPS,4)
// RF7PPS<RF7PPS5>
extern volatile __bit                   RF7PPS5             __at(0x1185);	// @ (0x230 * 8 + 5)
#define                                 RF7PPS5_bit         _BIT_ACCESS(RF7PPS,5)
// RF7PPS<RF7PPS6>
extern volatile __bit                   RF7PPS6             __at(0x1186);	// @ (0x230 * 8 + 6)
#define                                 RF7PPS6_bit         _BIT_ACCESS(RF7PPS,6)
// PCON0<RI>
extern volatile __bit                   RI                  __at(0x2782);	// @ (0x4F0 * 8 + 2)
#define                                 RI_bit              _BIT_ACCESS(PCON0,2)
// PCON0<RMCLR>
extern volatile __bit                   RMCLR               __at(0x2783);	// @ (0x4F0 * 8 + 3)
#define                                 RMCLR_bit           _BIT_ACCESS(PCON0,3)
// CPUDOZE<ROI>
extern volatile __bit                   ROI                 __at(0x2795);	// @ (0x4F2 * 8 + 5)
#define                                 ROI_bit             _BIT_ACCESS(CPUDOZE,5)
// ADRPT<RPT0>
extern volatile __bit                   RPT0                __at(0x1F38);	// @ (0x3E7 * 8 + 0)
#define                                 RPT0_bit            _BIT_ACCESS(ADRPT,0)
// ADRPT<RPT1>
extern volatile __bit                   RPT1                __at(0x1F39);	// @ (0x3E7 * 8 + 1)
#define                                 RPT1_bit            _BIT_ACCESS(ADRPT,1)
// ADRPT<RPT2>
extern volatile __bit                   RPT2                __at(0x1F3A);	// @ (0x3E7 * 8 + 2)
#define                                 RPT2_bit            _BIT_ACCESS(ADRPT,2)
// ADRPT<RPT3>
extern volatile __bit                   RPT3                __at(0x1F3B);	// @ (0x3E7 * 8 + 3)
#define                                 RPT3_bit            _BIT_ACCESS(ADRPT,3)
// ADRPT<RPT4>
extern volatile __bit                   RPT4                __at(0x1F3C);	// @ (0x3E7 * 8 + 4)
#define                                 RPT4_bit            _BIT_ACCESS(ADRPT,4)
// ADRPT<RPT5>
extern volatile __bit                   RPT5                __at(0x1F3D);	// @ (0x3E7 * 8 + 5)
#define                                 RPT5_bit            _BIT_ACCESS(ADRPT,5)
// ADRPT<RPT6>
extern volatile __bit                   RPT6                __at(0x1F3E);	// @ (0x3E7 * 8 + 6)
#define                                 RPT6_bit            _BIT_ACCESS(ADRPT,6)
// ADRPT<RPT7>
extern volatile __bit                   RPT7                __at(0x1F3F);	// @ (0x3E7 * 8 + 7)
#define                                 RPT7_bit            _BIT_ACCESS(ADRPT,7)
// I2C1PIE<RSC1IE>
extern volatile __bit                   RSC1IE              __at(0x14D9);	// @ (0x29B * 8 + 1)
#define                                 RSC1IE_bit          _BIT_ACCESS(I2C1PIE,1)
// I2C1PIR<RSC1IF>
extern volatile __bit                   RSC1IF              __at(0x14D1);	// @ (0x29A * 8 + 1)
#define                                 RSC1IF_bit          _BIT_ACCESS(I2C1PIR,1)
// I2C1PIE<RSCIE>
extern volatile __bit                   RSCIE               __at(0x14D9);	// @ (0x29B * 8 + 1)
#define                                 RSCIE_bit           _BIT_ACCESS(I2C1PIE,1)
// I2C1PIR<RSCIF>
extern volatile __bit                   RSCIF               __at(0x14D1);	// @ (0x29A * 8 + 1)
#define                                 RSCIF_bit           _BIT_ACCESS(I2C1PIR,1)
// I2C1CON0<RSEN>
extern volatile __bit                   RSEN                __at(0x14A6);	// @ (0x294 * 8 + 6)
#define                                 RSEN_bit            _BIT_ACCESS(I2C1CON0,6)
// SMT1STAT<RST>
extern volatile __bit                   RST                 __at(0x1875);	// @ (0x30E * 8 + 5)
#define                                 RST_bit             _BIT_ACCESS(SMT1STAT,5)
// PCON0<RWDT>
extern volatile __bit                   RWDT                __at(0x2784);	// @ (0x4F0 * 8 + 4)
#define                                 RWDT_bit            _BIT_ACCESS(PCON0,4)
// I2C1CON1<RXO>
extern volatile __bit                   RXO                 __at(0x14AA);	// @ (0x295 * 8 + 2)
